TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_unicommspi.h
/*! @enum DL_SPI_CHIP_SELECT */
typedef enum {
    /*! Chip Select 0 */
    DL_SPI_CHIP_SELECT_0 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_0),
    /*! Chip Select 1 */
    DL_SPI_CHIP_SELECT_1 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_1),
    /*! Chip Select 2 */
    DL_SPI_CHIP_SELECT_2 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_2),
    /*! Chip Select 3 */
    DL_SPI_CHIP_SELECT_3 = (UNICOMMSPI_CTL0_CSSEL_CSSEL_3),
    /*! No chip select */
    DL_SPI_CHIP_SELECT_NONE = (0)
} DL_SPI_CHIP_SELECT;

/*! @enum DL_SPI_TX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when TX FIFO <= 3/4 empty */
    DL_SPI_TX_FIFO_LEVEL_3_4_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when TX FIFO <= 1/2 empty (default) */
    DL_SPI_TX_FIFO_LEVEL_1_2_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when TX FIFO <= 1/4 empty */
    DL_SPI_TX_FIFO_LEVEL_1_4_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when TX FIFO is not totally full */
    DL_SPI_TX_FIFO_LEVEL_ONE_FRAME = UNICOMMSPI_IFLS_TXIFLSEL_LVL_NOT_FULL,
    /*! Interrupt triggers when TX FIFO is empty */
    DL_SPI_TX_FIFO_LEVEL_EMPTY = UNICOMMSPI_IFLS_TXIFLSEL_LVL_EMPTY,
    /*! Interrupt triggers when TX FIFO <= 1  */
    DL_SPI_TX_FIFO_LEVEL_ALMOST_EMPTY =
        UNICOMMSPI_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
    /*! Interrupt triggers when TX FIFO >= (MAX FIFO LEN) - 1 */
    DL_SPI_TX_FIFO_LEVEL_ALMOST_FULL =
        UNICOMMSPI_IFLS_TXIFLSEL_LVL_ALMOST_FULL,
} DL_SPI_TX_FIFO_LEVEL;

/*! @enum DL_SPI_RX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when RX FIFO >= 3/4 full */
    DL_SPI_RX_FIFO_LEVEL_3_4_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when RX FIFO >= 1/2 full (default) */
    DL_SPI_RX_FIFO_LEVEL_1_2_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when RX FIFO >= 1/4 full */
    DL_SPI_RX_FIFO_LEVEL_1_4_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when RX FIFO is not empty */
    DL_SPI_RX_FIFO_LEVEL_ONE_FRAME = UNICOMMSPI_IFLS_RXIFLSEL_LVL_NOT_EMPTY,
    /*! Interrupt triggers when RX FIFO is full */
    DL_SPI_RX_FIFO_LEVEL_FULL = UNICOMMSPI_IFLS_RXIFLSEL_LVL_FULL,
    /*! Interrupt triggers when RX FIFO >= (MAX FIFO LEN) - 1 */
    DL_SPI_RX_FIFO_LEVEL_ALMOST_FULL =
        UNICOMMSPI_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
    /*! Interrupt triggers when RX FIFO <= 1 */
    DL_SPI_RX_FIFO_LEVEL_ALMOST_EMPTY =
        UNICOMMSPI_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY,
} DL_SPI_RX_FIFO_LEVEL;

/*! @enum DL_SPI_IIDX */
typedef enum {

    /*! SPI interrupt index for DMA Done 1 event for transmit */
    DL_SPI_IIDX_DMA_DONE_TX = UNICOMMSPI_IIDX_STAT_DMA_DONE_TX,
    /*! SPI interrupt index for DMA Done 1 event for receive */
    DL_SPI_IIDX_DMA_DONE_RX = UNICOMMSPI_IIDX_STAT_DMA_DONE_RX,
    /*! SPI interrupt index for SPI to signal it has finished transfers and
     * changed into idle mode */

    DL_SPI_IIDX_IDLE = UNICOMMSPI_IIDX_STAT_IDLE_EVT,
    /*! SPI interrupt index for transmit FIFO empty */
    DL_SPI_IIDX_TX_EMPTY = UNICOMMSPI_IIDX_STAT_TX_EMPTY,
    /*! SPI interrupt index for transmit FIFO */
    DL_SPI_IIDX_TX = UNICOMMSPI_IIDX_STAT_TX_EVT,
    /*! SPI interrupt index for receive FIFO */
    DL_SPI_IIDX_RX = UNICOMMSPI_IIDX_STAT_RX_EVT,
    /*! SPI interrupt index for receive timeout */
    DL_SPI_IIDX_RX_TIMEOUT = UNICOMMSPI_IIDX_STAT_RTOUT_EVT,

    /*! SPI interrupt index for receive FIFO full  */
    DL_SPI_IIDX_RX_FULL = UNICOMMSPI_IIDX_STAT_RXFULL_EVT,
    /*! SPI interrupt index for transmit FIFO underflow  */
    DL_SPI_IIDX_TX_UNDERFLOW = UNICOMMSPI_IIDX_STAT_TXFIFO_UNF_EVT,

    /*! SPI interrupt index for parity error */
    DL_SPI_IIDX_PARITY_ERROR = UNICOMMSPI_IIDX_STAT_PER_EVT,
    /*! SPI interrupt index for receive FIFO overflow */
    DL_SPI_IIDX_RX_OVERFLOW = UNICOMMSPI_IIDX_STAT_RXFIFO_OFV_EVT,
    /*! SPI interrupt index for PREIRQ RX*/
    DL_SPI_IIDX_PREIRQ_RX = UNICOMMSPI_IIDX_STAT_DMA_PREIRQ_RX,
    /*! SPI interrupt index for PREIRQ TX*/
    DL_SPI_IIDX_PREIRQ_TX = UNICOMMSPI_IIDX_STAT_DMA_PREIRQ_TX,
    /*! SPI interrupt index for line time out*/
    DL_SPI_IIDX_LTOUT = UNICOMMSPI_IIDX_STAT_LTOUT,
} DL_SPI_IIDX;

/*! @enum DL_SPI_SPG_DMA_RX_DEST_ADDR*/
typedef enum {
    /*! Increment destination memory location after each transfer */
    DL_SPI_SPG_DMA_RX_DEST_ADDR_INCREMENT =
        UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_INCREMENT,
    /*! Decrement destination memory location after each transfer */
    DL_SPI_SPG_DMA_RX_DEST_ADDR_DECREMENT =
        UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_DECREMENT
} DL_SPI_SPG_DMA_RX_DEST_ADDR;

/*! @enum DL_SPI_SPG_DMA_RX_PREEMPT_INT */
typedef enum {
    /*! Disable pre-emptive interrupt */
    DL_SPI_SPG_DMA_RX_PREEMPT_INT_DISABLE =
        UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_PREIRQ_DISABLE,
    /*! Trigger interrupt pre-emptively when DMA transfer is half done */
    DL_SPI_SPG_DMA_RX_PREEMPT_INT_HALF =
        UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_PREIRQ_HALF
} DL_SPI_SPG_DMA_RX_PREEMPT_INT;

/*! @enum DL_SPI_SPG_DMA_RX_TRANSFER_MODE */
typedef enum {
    /*! DMA transfers defined number of elements and stops */
    DL_SPI_SPG_DMA_RX_TRANSFER_MODE_SINGLE =
        UNICOMMSPI_SPGDMARXCTL_DMATM_SINGLE,
    /*! DMA wraps around to the starting memory location after the configured number of transfers are completed */
    DL_SPI_SPG_DMA_RX_TRANSFER_MODE_REPEAT =
        UNICOMMSPI_SPGDMARXCTL_DMATM_RPTSNGL
} DL_SPI_SPG_DMA_RX_TRANSFER_MODE;

/*! @enum DL_SPI_SPG_DMA_RX_DATA_WIDTH */
typedef enum {
    /*! Width of each RX FIFO element is 1 Byte */
    DL_SPI_SPG_DMA_RX_DATA_WIDTH_BYTE = UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_BYTE,
    /*! Width of each RX FIFO element is half of 1 word */
    DL_SPI_SPG_DMA_RX_DATA_WIDTH_HALF = UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_HALF,
    /*! Width of each RX FIFO element is 1 word */
    DL_SPI_SPG_DMA_RX_DATA_WIDTH_WORD = UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_WORD,
} DL_SPI_SPG_DMA_RX_DATA_WIDTH;

/*! @enum DL_SPI_SPG_DMA_TX_DEST_ADDR*/
typedef enum {
    /*! Increment memory location after each transfer */
    DL_SPI_SPG_DMA_TX_DEST_ADDR_INCREMENT =
        UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_INCREMENT,
    /*! Decrement memory location after each transfer */
    DL_SPI_SPG_DMA_TX_DEST_ADDR_DECREMENT =
        UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_DECREMENT
} DL_SPI_SPG_DMA_TX_DEST_ADDR;

