TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_unicommspi.h
/**
 *  @brief      Fill the TX FIFO using 32 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  NOTE: If packing is enabled by calling @ref DL_SPI_enablePacking prior to
 *  calling this API, then a 32-bit write will be written as one FIFO entry. If
 *  packing is disabled, then a 32-bit write will be written as two FIFO
 *  entries.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of words to write to the TX FIFO
 *
 *  @return     Number of words written to the TX FIFO
 *
 *  @sa         DL_SPI_enablePacking
 */
uint32_t DL_SPI_fillTXFIFO32(
    UNICOMM_Inst_Regs *unicomm, uint32_t *buffer, uint32_t count);

/**
 *  @brief      Enable SPI interrupt for triggering the DMA receive event
 *
 * Enables the SPI interrupt to be used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
 * register, which is the event publisher used for triggering the DMA to do
 * a receive data transfer.
 *
 * @note Only one interrupt source should be enabled at a time.
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
 *                         the DMA. One of @ref DL_SPI_DMA_INTERRUPT_RX.
 */
__STATIC_INLINE void DL_SPI_enableDMAReceiveEvent(
    UNICOMM_Inst_Regs *unicomm, uint32_t interrupt)
{
    unicomm->spi->DMA_TRIG_RX.IMASK = interrupt;
}

/**
 *  @brief      Enable SPI interrupt for triggering the DMA transmit event
 *
 * Enables the SPI interrupt to be used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
 * register, which is the event publisher used for triggering the DMA to do
 * a transmit data transfer.
 *
 * @note DMA_TRIG_TX only has one transmit interrupt source
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 */
__STATIC_INLINE void DL_SPI_enableDMATransmitEvent(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->DMA_TRIG_TX.IMASK = UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_SET;
}

/**
 *  @brief      Disables SPI interrupt from triggering the DMA receive event
 *
 * Disables the SPI interrupt as the condition to generate an event to
 * directly trigger the DMA. This API configures the DMA_TRIG_RX
 * register, which is the event publisher used for triggering the DMA to do
 * a receive data transfer.
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
 *                         the DMA. One of @ref DL_SPI_DMA_INTERRUPT_RX.
 */
__STATIC_INLINE void DL_SPI_disableDMAReceiveEvent(
    UNICOMM_Inst_Regs *unicomm, uint32_t interrupt)
{
    unicomm->spi->DMA_TRIG_RX.IMASK &= ~(interrupt);
}

/**
 *  @brief      Disables SPI interrupt from triggering the DMA transmit event
 *
 * Disables the SPI interrupt as the condition to generate an event to
 * directly trigger the DMA. This API configures the DMA_TRIG_TX
 * register, which is the event publisher used for triggering the DMA to do
 * a transmit data transfer.
 *
 * @note DMA_TRIG_TX only has one transmit interrupt source
 *
 * @param[in]  unicomm       Pointer to the register overlay for the
 *                       peripheral
 */
__STATIC_INLINE void DL_SPI_disableDMATransmitEvent(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->DMA_TRIG_TX.IMASK = UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_CLR;
}

/**
 *  @brief      Check which SPI interrupt for DMA receive events is enabled
 *
 *  This API checks the DMA_TRIG_RX register, which is the event publisher used
 *  for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_SPI_DMA_INTERRUPT_RX.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     Which of the requested SPI interrupts is enabled
 *
 *  @retval     One of @ref DL_SPI_DMA_INTERRUPT_RX
 */
__STATIC_INLINE uint32_t DL_SPI_getEnabledDMAReceiveEvent(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    return (unicomm->spi->DMA_TRIG_RX.IMASK & interruptMask);
}

/**
 *  @brief      Check if SPI interrupt for DMA transmit event is enabled
 *
 *  This API checks the DMA_TRIG_TX register, which is the event publisher used
 *  for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  unicomm           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The requested SPI interrupt status
 *
 *  @retval     DL_SPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
 */
__STATIC_INLINE uint32_t DL_SPI_getEnabledDMATransmitEvent(
    UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->spi->DMA_TRIG_TX.IMASK &
            UNICOMMSPI_DMA_TRIG_TX_IMASK_TX_MASK);
}

/**
 *  @brief      Check interrupt flag of enabled SPI interrupt for DMA receive event
 *
 * Checks if any of the SPI interrupts for the DMA receive event that were
 * previously enabled are pending.
 * This API checks the DMA_TRIG_RX register, which is the event publisher used
 * for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_SPI_DMA_INTERRUPT_RX.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested SPI interrupt status
 *
 *  @retval     One of @ref DL_SPI_DMA_INTERRUPT_RX
 *
 *  @sa         DL_SPI_enableDMAReceiveEvent
 */
__STATIC_INLINE uint32_t DL_SPI_getEnabledDMAReceiveEventStatus(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    return (unicomm->spi->DMA_TRIG_RX.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled SPI interrupt for DMA transmit event
 *
 * Checks if the SPI interrupt for the DMA transmit event that was
 * previously enabled is pending.
 * This API checks the DMA_TRIG_TX register, which is the event publisher used
 * for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  unicomm           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The requested SPI interrupt status
 *
 *  @retval     DL_SPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
 *
 *  @sa         DL_SPI_enableDMATransmitEvent
 */
__STATIC_INLINE uint32_t DL_SPI_getEnabledDMATransmitEventStatus(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        unicomm->spi->DMA_TRIG_TX.MIS & UNICOMMSPI_DMA_TRIG_TX_MIS_TX_MASK);
}

/**
 *  @brief      Check interrupt flag of any SPI interrupt for DMA receive event
 *
 *  Checks if any of the SPI interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_RX register, which is the event publisher used
 *  for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_SPI_DMA_INTERRUPT_RX.
 *
 *  @return     Which of the requested SPI interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_SPI_DMA_INTERRUPT_RX values
 */
__STATIC_INLINE uint32_t DL_SPI_getRawDMAReceiveEventStatus(
    UNICOMM_Inst_Regs *unicomm, uint32_t interruptMask)
{
    return (unicomm->spi->DMA_TRIG_RX.RIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any SPI interrupt for DMA transmit event
 *
 *  Checks if any of the SPI interrupts for DMA transmit event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_TX register, which is the event publisher used
 *  for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  unicomm           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The requested SPI interrupt status
 *
 *  @retval     DL_SPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
 */
__STATIC_INLINE uint32_t DL_SPI_getRawDMATransmitEventStatus(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        unicomm->spi->DMA_TRIG_TX.RIS & UNICOMMSPI_DMA_TRIG_TX_RIS_TX_MASK);
}

/**
 *  @brief      Save SPI configuration before entering a power loss state.
 *
 *  Some peripherals residing in PD1 domain do not retain register
 *  contents when entering STOP or STANDBY modes. Please refer to the datasheet
 *  for the full list of peripheral instances that exhibit this behavior.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  ptr  Configuration backup setup structure. See
 *                  @ref DL_SPI_backupConfig.
 *
 *  @retval     FALSE if a configuration already exists in ptr (will not be
 *              overwritten). TRUE if a configuration was successfully saved
 *
 *  @sa         DL_SPI_restoreConfiguration
 */
bool DL_SPI_saveConfiguration(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_backupConfig *ptr);

/**
 *  @brief      Restore SPI configuration after leaving a power loss state.
 *
 *  Some peripherals residing in PD1 domain do not retain register
 *  contents when entering STOP or STANDBY modes. Please refer to the datasheet
 *  for the full list of peripheral instances that exhibit this behavior.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  ptr   Configuration backup setup structure. See
 *                    @ref DL_SPI_backupConfig.
 *
 *  @retval     FALSE if a configuration does not exist in ptr (will not be
 *              loaded). TRUE if a configuration successfully loaded
 *
 *  @sa         DL_SPI_saveConfiguration
 */
bool DL_SPI_restoreConfiguration(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_backupConfig *ptr);

/**
 *  @brief      Enable SPG DMA receive channel
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 */
__STATIC_INLINE void DL_SPI_enableSPGDMAReceiveChannel(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->SPGDMA.SPGDMARXCTL |= UNICOMMSPI_SPGDMARXCTL_DMAEN_ENABLE;
}

/**
 *  @brief      Disable SPG DMA receive channel
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 */
__STATIC_INLINE void DL_SPI_disableSPGDMAReceiveChannel(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->SPGDMA.SPGDMARXCTL &= ~(UNICOMMSPI_SPGDMARXCTL_DMAEN_ENABLE);
}

/**
 *  @brief      Set SPG DMA receive channel destination increment
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  The increment direction to use.
 *                      One of @ref DL_SPI_SPG_DMA_RX_DEST_ADDR.
 */
__STATIC_INLINE void DL_SPI_setSPGDMAReceiveIncrement(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_RX_DEST_ADDR config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMARXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_MASK);
}
/**
 *  @brief      Get SPG DMA receive channel destination increment
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured destincation increment schema for receive channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_RX_DEST_ADDR
 */
__STATIC_INLINE DL_SPI_SPG_DMA_RX_DEST_ADDR DL_SPI_getSPGDMAReceiveIncrement(
    UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_RX_DEST_ADDR)(
        unicomm->spi->SPGDMA.SPGDMARXCTL &
        UNICOMMSPI_SPGDMARXCTL_DMAMEMINCR_MASK);
}

/**
 *  @brief      Set SPG DMA receive channel pre-emptive interrupt
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Pre-emptive interrupt schema to use.
 *                      One of @ref DL_SPI_SPG_DMA_RX_PREEMPT_INT.
 */
__STATIC_INLINE void DL_SPI_setSPGDMAReceivePreemtiveInterrupt(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_RX_PREEMPT_INT config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMARXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_MASK);
}
/**
 *  @brief      Get SPG DMA receive channel pre-emptive interrupt
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured pre-emptive interrupt schema for receive channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_RX_PREEMPT_INT
 */
__STATIC_INLINE DL_SPI_SPG_DMA_RX_PREEMPT_INT
DL_SPI_getSPGDMAReceivePreemtiveInterrupt(UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_RX_PREEMPT_INT)(
        unicomm->spi->SPGDMA.SPGDMARXCTL &
        UNICOMMSPI_SPGDMARXCTL_DMAPREIRQ_MASK);
}

/**
 *  @brief      Set SPG DMA receive channel transfer mode
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Transfer mode to use.
 *                      One of @ref DL_SPI_SPG_DMA_RX_TRANSFER_MODE.
 */
__STATIC_INLINE void DL_SPI_setSPGDMAReceiveTransferMode(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_RX_TRANSFER_MODE config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMARXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMARXCTL_DMATM_MASK);
}
/**
 *  @brief      Get SPG DMA receive channel transfer mode
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured transfer mode for receive channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_RX_TRANSFER_MODE
 */
__STATIC_INLINE DL_SPI_SPG_DMA_RX_TRANSFER_MODE
DL_SPI_getSPGDMAReceiveTransferMode(UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_RX_TRANSFER_MODE)(
        unicomm->spi->SPGDMA.SPGDMARXCTL & UNICOMMSPI_SPGDMARXCTL_DMATM_MASK);
}

/**
 *  @brief      Set SPG DMA receive channel data width
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Data width to use.
 *                      One of @ref DL_SPI_SPG_DMA_RX_DATA_WIDTH.
 */
__STATIC_INLINE void DL_SPI_setSPGDMAReceiveDataWidth(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_RX_DATA_WIDTH config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMARXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_MASK);
}
/**
 *  @brief      Get SPG DMA receive channel data width
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured data width for receive channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_RX_DATA_WIDTH
 */
__STATIC_INLINE DL_SPI_SPG_DMA_RX_DATA_WIDTH DL_SPI_getSPGDMAReceiveDataWidth(
    UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_RX_DATA_WIDTH)(
        unicomm->spi->SPGDMA.SPGDMARXCTL &
        UNICOMMSPI_SPGDMARXCTL_DMADSTWDTH_MASK);
}

/**
 *  @brief      Set SPG DMA receive channel memory starting address
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  address  Starting memory address to use
 */
__STATIC_INLINE void DL_SPI_setSPGDMAReceiveStartAddress(
    UNICOMM_Inst_Regs *unicomm, uint32_t address)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMARXDA, address,
        UNICOMMSPI_SPGDMARXDA_ADDR_MAXIMUM);
}
/**
 *  @brief      Get SPG DMA receive channel memory starting address
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured memory starting address for receive channel
 */
__STATIC_INLINE uint32_t DL_SPI_getSPGDMAReceiveStartAddress(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        unicomm->spi->SPGDMA.SPGDMARXDA & UNICOMMSPI_SPGDMARXDA_ADDR_MAXIMUM);
}

/**
 *  @brief      Set SPG DMA receive channel size
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  size  Starting memory address to use
 */
__STATIC_INLINE void DL_SPI_setSPGDMAReceiveChannelSize(
    UNICOMM_Inst_Regs *unicomm, uint16_t size)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMARXSZ, (uint32_t) size,
        UNICOMMSPI_SPGDMARXSZ_SIZE_MAXIMUM);
}
/**
 *  @brief      Get SPG DMA receive channel size
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured size of receive channel
 */
__STATIC_INLINE uint16_t DL_SPI_getSPGDMAReceiveChannelSize(
    UNICOMM_Inst_Regs *unicomm)
{
    return (uint16_t)(
        unicomm->spi->SPGDMA.SPGDMARXSZ & UNICOMMSPI_SPGDMARXSZ_SIZE_MAXIMUM);
}

/**
 *  @brief      Enable SPG DMA transmit channel
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 */
__STATIC_INLINE void DL_SPI_enableSPGDMATransmitChannel(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->SPGDMA.SPGDMATXCTL |= UNICOMMSPI_SPGDMATXCTL_DMAEN_ENABLE;
}

/**
 *  @brief      Disable SPG DMA transmit channel
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the
 *                         peripheral
 */
__STATIC_INLINE void DL_SPI_disableSPGDMATransmitChannel(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->SPGDMA.SPGDMATXCTL &= ~(UNICOMMSPI_SPGDMATXCTL_DMAEN_ENABLE);
}

/**
 *  @brief      Set SPG DMA transmit channel destination increment
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  The increment direction to use.
 *                      One of @ref DL_SPI_SPG_DMA_TX_DEST_ADDR.
 */
__STATIC_INLINE void DL_SPI_setSPGDMATransmitIncrement(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_TX_DEST_ADDR config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMATXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_MASK);
}
/**
 *  @brief      Get SPG DMA transmit channel destination increment
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured destincation increment schema for transmit channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_TX_DEST_ADDR
 */
__STATIC_INLINE DL_SPI_SPG_DMA_TX_DEST_ADDR DL_SPI_getSPGDMATransmitIncrement(
    UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_TX_DEST_ADDR)(
        unicomm->spi->SPGDMA.SPGDMATXCTL &
        UNICOMMSPI_SPGDMATXCTL_DMAMEMINCR_MASK);
}

/**
 *  @brief      Set SPG DMA transmit channel pre-emptive interrupt
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Pre-emptive interrupt schema to use.
 *                      One of @ref DL_SPI_SPG_DMA_TX_PREEMPT_INT.
 */
__STATIC_INLINE void DL_SPI_setSPGDMATransmitPreemtiveInterrupt(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_TX_PREEMPT_INT config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMATXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMATXCTL_DMAPREIRQ_MASK);
}
/**
 *  @brief      Get SPG DMA transmit channel pre-emptive interrupt
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured pre-emptive interrupt schema for transmit channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_TX_PREEMPT_INT
 */
__STATIC_INLINE DL_SPI_SPG_DMA_TX_PREEMPT_INT
DL_SPI_getSPGDMATransmitPreemtiveInterrupt(UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_TX_PREEMPT_INT)(
        unicomm->spi->SPGDMA.SPGDMATXCTL &
        UNICOMMSPI_SPGDMATXCTL_DMAPREIRQ_MASK);
}

/**
 *  @brief      Set SPG DMA transmit channel transfer mode
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Transfer mode to use.
 *                      One of @ref DL_SPI_SPG_DMA_TX_TRANSFER_MODE.
 */
__STATIC_INLINE void DL_SPI_setSPGDMATransmitTransferMode(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_TX_TRANSFER_MODE config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMATXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMATXCTL_DMATM_MASK);
}
/**
 *  @brief      Get SPG DMA transmit channel transfer mode
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured transfer mode for transmit channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_TX_TRANSFER_MODE
 */
__STATIC_INLINE DL_SPI_SPG_DMA_TX_TRANSFER_MODE
DL_SPI_getSPGDMATransmitTransferMode(UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_TX_TRANSFER_MODE)(
        unicomm->spi->SPGDMA.SPGDMATXCTL & UNICOMMSPI_SPGDMATXCTL_DMATM_MASK);
}

/**
 *  @brief      Set SPG DMA transmit channel data width
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  config  Data width to use.
 *                      One of @ref DL_SPI_SPG_DMA_TX_DATA_WIDTH.
 */
__STATIC_INLINE void DL_SPI_setSPGDMATransmitDataWidth(
    UNICOMM_Inst_Regs *unicomm, DL_SPI_SPG_DMA_TX_DATA_WIDTH config)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMATXCTL, (uint32_t) config,
        UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_MASK);
}
/**
 *  @brief      Get SPG DMA transmit channel data width
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured data width for transmit channel
 *  @retval  One of @ref DL_SPI_SPG_DMA_TX_DATA_WIDTH
 */
__STATIC_INLINE DL_SPI_SPG_DMA_TX_DATA_WIDTH DL_SPI_getSPGDMATransmitDataWidth(
    UNICOMM_Inst_Regs *unicomm)
{
    return (DL_SPI_SPG_DMA_TX_DATA_WIDTH)(
        unicomm->spi->SPGDMA.SPGDMATXCTL &
        UNICOMMSPI_SPGDMATXCTL_DMASRCWDTH_MASK);
}

/**
 *  @brief      Set SPG DMA transmit channel memory starting address
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  address  Starting memory address to use
 */
__STATIC_INLINE void DL_SPI_setSPGDMATransmitStartAddress(
    UNICOMM_Inst_Regs *unicomm, uint32_t address)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMATXSA, address,
        UNICOMMSPI_SPGDMATXSA_ADDR_MAXIMUM);
}
/**
 *  @brief      Get SPG DMA transmit channel memory starting address
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured memory starting address for transmit channel
 */
__STATIC_INLINE uint32_t DL_SPI_getSPGDMATransmitStartAddress(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        unicomm->spi->SPGDMA.SPGDMATXSA & UNICOMMSPI_SPGDMATXSA_ADDR_MAXIMUM);
}

/**
 *  @brief      Set SPG DMA transmit channel size
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *  @param[in]  size  Starting memory address to use
 */
__STATIC_INLINE void DL_SPI_setSPGDMATransmitChannelSize(
    UNICOMM_Inst_Regs *unicomm, uint16_t size)
{
    DL_Common_updateReg(&unicomm->spi->SPGDMA.SPGDMATXSZ, (uint32_t) size,
        UNICOMMSPI_SPGDMATXSZ_SIZE_MAXIMUM);
}
/**
 *  @brief      Get SPG DMA transmit channel size
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the peripheral
 *
 *  @return  Configured size of transmit channel
 */
__STATIC_INLINE uint16_t DL_SPI_getSPGDMATransmitChannelSize(
    UNICOMM_Inst_Regs *unicomm)
{
    return (uint16_t)(
        unicomm->spi->SPGDMA.SPGDMATXSZ & UNICOMMSPI_SPGDMATXSZ_SIZE_MAXIMUM);
}

/**
 *  @brief      Suspend external communication
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_SPI_enableSuspend(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->CTL1 |= UNICOMMSPI_CTL1_SUSPEND_ENABLE;
}

/**
 *  @brief      Resume external communication
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_SPI_disableSuspend(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->spi->CTL1 &= ~(UNICOMMSPI_CTL1_SUSPEND_MASK);
}

#ifdef __cplusplus
}
#endif

#endif /* __MCU_HAS_UNICOMMSPI__ */

#endif /* ti_dl_dl_UNICOMMSPI__include */
/** @}*/
